lalith-ais/ch32v307-lwip/lwip/src/lwip_task.c
/*
 * Copyright (c) 2022, smartmx - smartmx@qq.com
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 *
 */

#include "ch32v30x_eth.h"
#include "Debug/debug.h"
#include "lwip_task.h"

/* Global variable */
LIST(ch307_mac_rec);
MEMB(ch307_mac_rec_frame_mem, FrameTypeDef, ETH_RXBUFNB);

__attribute__ ((aligned(4))) ETH_DMADESCTypeDef DMARxDscrTab[ETH_RXBUFNB];/* Receive ethernet packet descriptor table / 接收描述符表 */
__attribute__ ((aligned(4))) ETH_DMADESCTypeDef DMATxDscrTab[ETH_TXBUFNB];/* Transmit ethernet packet descriptor table / 发送描述符表 */
__attribute__ ((aligned(4))) uint8_t Rx_Buff[ETH_RXBUFNB][ETH_MAX_PACKET_SIZE];/* Receive ethernet packet data / 接收队列 */
__attribute__ ((aligned(4))) uint8_t Tx_Buff[ETH_TXBUFNB][ETH_MAX_PACKET_SIZE];/* Transmit ethernet packet data / 发送队列 */

/* extern variable */

/* Macro */
#ifndef ETH_ERROR
#define  ETH_ERROR              ((uint32_t)0)
#endif

#ifndef ETH_SUCCESS
#define  ETH_SUCCESS            ((uint32_t)1)
#endif

#define  ETH_DMARxDesc_FrameLengthShift           16

#define define_O(a,b) \
GPIO_InitStructure.GPIO_Pin = b;\
GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;\
GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;\
GPIO_Init(a, &GPIO_InitStructure)

#define define_I(a,b) \
GPIO_InitStructure.GPIO_Pin = b;\
GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;\
GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;\
GPIO_Init(a, &GPIO_InitStructure)


/*********************************************************************
 * @fn      Ethernet_LED_LINKSET
 *
 * @brief   set eth link led,setbit 0 or 1,the link led turn on or turn off
 *
 * @return  none
 */
void Ethernet_LED_LINKSET(uint8_t setbit)
{
     if(setbit){
         GPIO_SetBits(GPIOB, GPIO_Pin_8);
     }
     else {
         GPIO_ResetBits(GPIOB, GPIO_Pin_8);
    }
}


/*********************************************************************
 * @fn      Ethernet_LED_DATASET
 *
 * @brief   set eth data led,setbit 0 or 1,the data led turn on or turn off
 *
 * @return  none
 */
void Ethernet_LED_DATASET(uint8_t setbit)
{
     if(setbit){
         GPIO_SetBits(GPIOB, GPIO_Pin_9);
     }
     else {
         GPIO_ResetBits(GPIOB, GPIO_Pin_9);
    }
}


/*********************************************************************
 * @fn      CH307_INIT_PHY
 *
 * @brief   init ch307 on chip 10M-phy
 *
 * @return  none
 */
OS_SUBNT(CH307_INIT_PHY, void)
{
    OS_SUBNT_START();
    /* SET_MCO */
    GPIO_InitTypeDef GPIO={0};
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);

    GPIO.GPIO_Pin = GPIO_Pin_8;
    GPIO.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO.GPIO_Speed = GPIO_Speed_50MHz;

    GPIO_Init(GPIOA,&GPIO);

    RCC_PLL3Cmd(DISABLE);
    RCC_PREDIV2Config(RCC_PREDIV2_Div2);
    RCC_PLL3Config(RCC_PLL3Mul_15);
    RCC_MCOConfig(RCC_MCO_PLL3CLK);
    RCC_PLL3Cmd(ENABLE);

    OS_SUBNT_WAITX(OS_SEC_TICKS / 10);

    if(RESET == RCC_GetFlagStatus(RCC_FLAG_PLL3RDY))
    {
        printf("Wait for PLL3 ready.\n");
        OS_SUBNT_CWAITX(OS_SEC_TICKS / 2);
    }
    printf("PLL3 is ready.\n");
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);

    /* Ethernet LED Configuration */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
    GPIO.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9;
    GPIO.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB,&GPIO);
    Ethernet_LED_LINKSET(1);/* turn off link led. */
    Ethernet_LED_DATASET(1);/* turn off data led. */

    /* Ethernet_Configuration */
    /* MUST use static in OS_TASK */
    static ETH_InitTypeDef *ETH_InitStructure;
    static uint32_t timeout;

    ETH_InitStructure = mem_malloc(sizeof(ETH_InitTypeDef));
    memset(ETH_InitStructure, 0, sizeof(ETH_InitTypeDef));
    /* Enable Ethernet MAC clock */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC|RCC_AHBPeriph_ETH_MAC_Tx|RCC_AHBPeriph_ETH_MAC_Rx,ENABLE);

#ifdef USE10BASE_T
    /* Enable internal 10BASE-T PHY / 使能10M以太网物理层*/
    EXTEN->EXTEN_CTR |=EXTEN_ETH_10M_EN;
#endif

#ifdef USE_GIGA_MAC
    /* Enable 1G MAC / 使能1G以太网MAC */
    EXTEN->EXTEN_CTR |= EXTEN_ETH_RGMII_SEL;
    RCC_ETH1GCLKConfig(RCC_ETH1GCLKSource_PB1_IN);/* Select external 125MHz input / 选择外部125MHz输入 */
    RCC_ETH1G_125Mcmd(ENABLE);/* Enable 125MHz clock / 使能125MHz时钟 */

    /*  Enable RGMII GPIO */
    GETH_pin_init();
#endif

#ifdef USE_FAST_MAC
    /*  Enable MII or RMII GPIO */
    FETH_pin_init();
#endif

    /* Reset ETHERNET on AHB Bus */
    ETH_DeInit();

    /* Software reset */
    ETH_SoftwareReset();

    /* Wait for software reset */
    timeout=10;
    OS_SUBNT_SET_STATE();
    if(ETH->DMABMR & ETH_DMABMR_SR)
    {
        timeout--;
        if(timeout==0)
        {
            printf("Error:Eth soft-reset timeout!\nPlease check RGMII TX & RX clock line.\n");
        }
        OS_SUBNT_CWAITX(OS_SEC_TICKS / 100);
    }

    /* ETHERNET Configuration ------------------------------------------------------*/
    /* Call ETH_StructInit if you don't like to configure all ETH_InitStructure parameter */
    ETH_StructInit(ETH_InitStructure);
    /* Fill ETH_InitStructure parametrs */
    /*------------------------   MAC   -----------------------------------*/
    ETH_InitStructure->ETH_Mode = ETH_Mode_FullDuplex;
    ETH_InitStructure->ETH_Speed = ETH_Speed_1000M;
    ETH_InitStructure->ETH_AutoNegotiation = ETH_AutoNegotiation_Enable  ;
    ETH_InitStructure->ETH_LoopbackMode = ETH_LoopbackMode_Disable;
    ETH_InitStructure->ETH_RetryTransmission = ETH_RetryTransmission_Disable;
    ETH_InitStructure->ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
    ETH_InitStructure->ETH_ReceiveAll = ETH_ReceiveAll_Enable;
    ETH_InitStructure->ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;
    ETH_InitStructure->ETH_PromiscuousMode = ETH_PromiscuousMode_Enable;
    ETH_InitStructure->ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_Perfect;
    ETH_InitStructure->ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;
#ifdef CHECKSUM_BY_HARDWARE
    ETH_InitStructure->ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;
#endif
    /*------------------------   DMA   -----------------------------------*/
    /* When we use the Checksum offload feature, we need to enable the Store and Forward mode:
    the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can insert/verify the checksum,
    if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
    ETH_InitStructure->ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
    ETH_InitStructure->ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
    ETH_InitStructure->ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;
    ETH_InitStructure->ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Enable;
    ETH_InitStructure->ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Enable;
    ETH_InitStructure->ETH_SecondFrameOperate = ETH_SecondFrameOperate_Disable;
    ETH_InitStructure->ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
    ETH_InitStructure->ETH_FixedBurst = ETH_FixedBurst_Enable;
    ETH_InitStructure->ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
    ETH_InitStructure->ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
    ETH_InitStructure->ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

    /* Configure Ethernet */
    uint32_t tmpreg = 0;
    static uint16_t RegValue = 0;

    /*---------------------- Physical Layer Config / 物理层配置 -------------------*/
    /* Set the SMI interface clock= main freq/42 / 置SMI接口时钟 ，置为主频的42分频  */
    tmpreg = ETH->MACMIIAR;
    tmpreg &= MACMIIAR_CR_MASK;
    tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div42;
    ETH->MACMIIAR = (uint32_t)tmpreg;

    /* reset PHY / 复位物理层 */
    ETH_WritePHYRegister(PHY_ADDRESS, PHY_BCR, PHY_Reset);

    OS_SUBNT_WAITX(OS_SEC_TICKS / 10);/* wait for PHY reset / 复位延迟  */

    timeout=10000;/* wait up to 10s for reset / 最大超时十秒   */
    RegValue = 0;

    OS_SUBNT_SET_STATE();

    RegValue = ETH_ReadPHYRegister(PHY_ADDRESS, PHY_BCR);
    if((RegValue & (PHY_Reset)))
    {
        timeout--;
        if(timeout<=0)
        {
          printf("Error:Wait phy software timeout!\nPlease cheak PHY/MID.\nProgram has been blocked!\n");
          while(1);
        }
        OS_SUBNT_CWAITX(OS_SEC_TICKS / 1000);
    }

    /* Wait for link up / 等待物理层与对端建立LINK */
    timeout=10000; /* 10s / 最大超时十秒   */
    RegValue = 0;

    OS_SUBNT_SET_STATE();

