lalith-ais/ch32v307-lwip/lwip/src/lwip_task.c
    RegValue = ETH_ReadPHYRegister(PHY_ADDRESS, PHY_BSR);
    if((RegValue & (PHY_Linked_Status)) == 0)
    {
        timeout--;
        if(timeout<=0)
        {
          printf("Error:Wait phy linking timeout!\nPlease cheak MID.\nProgram has been blocked!\n");
          while(1);
        }
        OS_SUBNT_CWAITX(OS_SEC_TICKS / 1000);
    }

    /* wait for NWAY auto-negotation / 等待物理层完成自动协商 */
    timeout=10000;/* 10s / 最大超时十秒   */
    RegValue = 0;

    OS_SUBNT_SET_STATE();

    RegValue = ETH_ReadPHYRegister(PHY_ADDRESS, PHY_BSR);
    if( (RegValue & PHY_AutoNego_Complete) == 0 )
    {
        timeout--;
        if(timeout<=0)
        {
          printf("Error:Wait phy auto-negotiation complete timeout!\nPlease cheak MID.\nProgram has been blocked!\n");
          while(1);
        }
        OS_SUBNT_CWAITX(OS_SEC_TICKS / 1000);
    }

    RegValue = ETH_ReadPHYRegister( PHY_ADDRESS, 0x10 );
    printf("PHY_SR value:%04x.\n", RegValue);

    if( RegValue & (1<<2) )
    {
        ETH_InitStructure->ETH_Mode = ETH_Mode_FullDuplex;
      printf("Full Duplex.\n");
    }
    else
    {
        ETH_InitStructure->ETH_Mode = ETH_Mode_HalfDuplex;
      printf("Half Duplex.\n");
    }
    ETH_InitStructure->ETH_Speed = ETH_Speed_10M;
    if(RegValue & (1<<3))
    {
      printf("Loopback_10M \n");
    }
    else
    {
    }

    OS_SUBNT_WAITX(OS_SEC_TICKS / 10);

    /* link up, led on / 点亮link状态led灯 */
    Ethernet_LED_LINKSET(0);

    /*------------------------ MAC config / MAC寄存器配置  ----------------------- --------------------*/
    /* note: MACCR has a timing setting for RGMII (gigabit) / MACCCR在RGMII接口模式下具有调整RGMII接口时序的域，请注意 */
    tmpreg = ETH->MACCR;
    tmpreg &= MACCR_CLEAR_MASK;
    tmpreg |= (uint32_t)(ETH_InitStructure->ETH_Watchdog |
                    ETH_InitStructure->ETH_Jabber |
                    ETH_InitStructure->ETH_InterFrameGap |
                    ETH_InitStructure->ETH_CarrierSense |
                    ETH_InitStructure->ETH_Speed |
                    ETH_InitStructure->ETH_ReceiveOwn |
                    ETH_InitStructure->ETH_LoopbackMode |
                    ETH_InitStructure->ETH_Mode |
                    ETH_InitStructure->ETH_ChecksumOffload |
                    ETH_InitStructure->ETH_RetryTransmission |
                    ETH_InitStructure->ETH_AutomaticPadCRCStrip |
                    ETH_InitStructure->ETH_BackOffLimit |
                    ETH_InitStructure->ETH_DeferralCheck);
    /* Write MAC config / 写MAC控制寄存器 */
    ETH->MACCR = (uint32_t)tmpreg;
  #ifdef USE10BASE_T
    ETH->MACCR|=ETH_Internal_Pull_Up_Res_Enable;/* Enable internal pull-up / 启用内部上拉  */
  #endif
    ETH->MACFFR = (uint32_t)(ETH_InitStructure->ETH_ReceiveAll |
                            ETH_InitStructure->ETH_SourceAddrFilter |
                            ETH_InitStructure->ETH_PassControlFrames |
                            ETH_InitStructure->ETH_BroadcastFramesReception |
                            ETH_InitStructure->ETH_DestinationAddrFilter |
                            ETH_InitStructure->ETH_PromiscuousMode |
                            ETH_InitStructure->ETH_MulticastFramesFilter |
                            ETH_InitStructure->ETH_UnicastFramesFilter);
    /*--------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------*/
    /* Write to ETHERNET MACHTHR */
    ETH->MACHTHR = (uint32_t)ETH_InitStructure->ETH_HashTableHigh;
    /* Write to ETHERNET MACHTLR */
    ETH->MACHTLR = (uint32_t)ETH_InitStructure->ETH_HashTableLow;
    /*----------------------- ETHERNET MACFCR Configuration --------------------*/
    /* Get the ETHERNET MACFCR value */
    tmpreg = ETH->MACFCR;
    /* Clear xx bits */
    tmpreg &= MACFCR_CLEAR_MASK;

    tmpreg |= (uint32_t)((ETH_InitStructure->ETH_PauseTime << 16) |
                     ETH_InitStructure->ETH_ZeroQuantaPause |
                     ETH_InitStructure->ETH_PauseLowThreshold |
                     ETH_InitStructure->ETH_UnicastPauseFrameDetect |
                     ETH_InitStructure->ETH_ReceiveFlowControl |
                     ETH_InitStructure->ETH_TransmitFlowControl);
    ETH->MACFCR = (uint32_t)tmpreg;

    ETH->MACVLANTR = (uint32_t)(ETH_InitStructure->ETH_VLANTagComparison |
                               ETH_InitStructure->ETH_VLANTagIdentifier);

    tmpreg = ETH->DMAOMR;
    /* Clear xx bits */
    tmpreg &= DMAOMR_CLEAR_MASK;

    tmpreg |= (uint32_t)(ETH_InitStructure->ETH_DropTCPIPChecksumErrorFrame |
                    ETH_InitStructure->ETH_ReceiveStoreForward |
                    ETH_InitStructure->ETH_FlushReceivedFrame |
                    ETH_InitStructure->ETH_TransmitStoreForward |
                    ETH_InitStructure->ETH_TransmitThresholdControl |
                    ETH_InitStructure->ETH_ForwardErrorFrames |
                    ETH_InitStructure->ETH_ForwardUndersizedGoodFrames |
                    ETH_InitStructure->ETH_ReceiveThresholdControl |
                    ETH_InitStructure->ETH_SecondFrameOperate);
    ETH->DMAOMR = (uint32_t)tmpreg;

    ETH->DMABMR = (uint32_t)(ETH_InitStructure->ETH_AddressAlignedBeats |
                            ETH_InitStructure->ETH_FixedBurst |
                            ETH_InitStructure->ETH_RxDMABurstLength | /* !! if 4xPBL is selected for Tx or Rx it is applied for the other */
                            ETH_InitStructure->ETH_TxDMABurstLength |
                           (ETH_InitStructure->ETH_DescriptorSkipLength << 2) |
                            ETH_InitStructure->ETH_DMAArbitration |
                            ETH_DMABMR_USP);
    mem_free(ETH_InitStructure);
    /* Enable the Ethernet Rx Interrupt */
    ETH_DMAITConfig(ETH_DMA_IT_NIS
                  | ETH_DMA_IT_R
                  | ETH_DMA_IT_T
                  ,ENABLE);

    NVIC_EnableIRQ(ETH_IRQn);
    ETH_DMATxDescChainInit(DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);
    ETH_DMARxDescChainInit(DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);
    ETH_Start();

    OS_SUBNT_END();
}


