lalith-ais/ch32v307-lwip/lwip/src/lwip_task.c
struct netif WCH_NetIf;

ip4_addr_t ipaddr;
ip4_addr_t netmask;
ip4_addr_t gw;
uint8_t IP_ADDRESS[4];
uint8_t NETMASK_ADDRESS[4];
uint8_t GATEWAY_ADDRESS[4];

static void wait_dhcp(void *arg) {
    if(ip_addr_cmp(&(WCH_NetIf.ip_addr),&ipaddr))   // Wait for DHCP config / 等待dhcp分配的ip有效
    {
        sys_timeout(50, wait_dhcp, NULL);
    }
    else
    {
        lwip_init_success_callback(&(WCH_NetIf.ip_addr)); /* notify callback about dhcp up / ip分配成功回调，用户在此增加关于网络进程的初始化函数 */
    }
}

OS_TASK(os_lwip, void)
{
    OS_TASK_START(os_lwip);

    /* mem_init of lwip, init outside the lwip_init for user to using outside. */
    mem_init();

    /* call sub task ch307 init phy */
    OS_CALL_SUBNT(CH307_INIT_PHY);
    printf("CH307_INIT_PHY ok\n");

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_RNG, ENABLE);
    RNG_Cmd(ENABLE);
    printf("enable rng ok\n");
#if LWIP_DHCP
    ip_addr_set_zero_ip4(&(WCH_NetIf.ip_addr));
    ip_addr_set_zero_ip4(&ipaddr);
    ip_addr_set_zero_ip4(&netmask);
    ip_addr_set_zero_ip4(&gw);
#else
    /* IP addresses initialization */
    IP4_ADDR(&ipaddr,192,168,123,105);
    IP4_ADDR(&netmask,255,255,255,0);
    IP4_ADDR(&gw,192,168,123,1);
#endif
    /* Initilialize the LwIP stack without RTOS */
    lwip_init();

    /* add the network interface (IPv4/IPv6) without RTOS */
    netif_add(&WCH_NetIf, &ipaddr, &netmask, &gw, NULL, &ethernetif_init, &ethernet_input);

    /* Registers the default network interface */
    netif_set_default(&WCH_NetIf);

    if (netif_is_link_up(&WCH_NetIf))
    {
        /* When the netif is fully configured this function must be called */
        netif_set_up(&WCH_NetIf);
#if LWIP_DHCP
        int err;
        /*  Creates a new DHCP client for this interface on the first call.
        Note: you must call dhcp_fine_tmr() and dhcp_coarse_tmr() at
        the predefined regular intervals after starting the client.
        You can peek in the netif->dhcp struct for the actual DHCP status.*/

        printf("This routine will use DHCP to dynamically assign IP addresses.\n");
        printf("本例程将使用DHCP动态分配IP地址,如果不需要则在lwipopts.h中将LWIP_DHCP定义为0\n\n");

        err = dhcp_start(&WCH_NetIf);      // start dhcp / 开启dhcp
        if(err == ERR_OK)
        {
            printf("lwip dhcp start success...\n\n");
        }
        else
        {
            printf("lwip dhcp start fail...\n\n");
        }
        sys_timeout(50, wait_dhcp, NULL);

#else
        lwip_init_success_callback(&(WCH_NetIf.ip_addr)); /* notify callback about static ip / ip分配成功回调，用户在此增加关于网络进程的初始化函数*/

#endif
        OS_TASK_RESTART_ANOTHER(os_lwip_timeouts, 5);  /* start processing timed tasks / 开始超时任务处理 */

        {
            OS_TASK_SET_STATE();
            if(list_head(ch307_mac_rec) != NULL)
            {
                /* received a packet */
                ethernetif_input(&WCH_NetIf);
            }
            OS_TASK_CWAITX(0);      /* constantly poll for packets / 不断轮询有没有数据包需要处理 */
        }
    }
    else
    {
        /* When the netif link is down this function must be called */
        netif_set_down(&WCH_NetIf);
    }
    OS_TASK_END(os_lwip);
}

OS_TASK(os_lwip_timeouts, void)
{
    OS_TASK_START(os_lwip_timeouts);

    {
        OS_TASK_SET_STATE();
        sys_check_timeouts();
        OS_TASK_CWAITX(5);      /* check again in 5ms / 5ms检查一次timeouts超时 */
    }

    OS_TASK_END(os_lwip_timeouts);
}

__attribute__((naked)) void ETH_IRQHandler() {
    __asm volatile ("call ETH_IRQHandler_real; mret");
}
/*********************************************************************
 * @fn      ETH_IRQHandler
 *
 * @brief   This function handles ETH exception.
 *
 * @return  none
 */
void ETH_IRQHandler_real(void)
{
    void *p;
    if(ETH->DMASR&ETH_DMA_IT_R)
    {
        ETH_DMAClearITPendingBit(ETH_DMA_IT_R);

        p = ETH_RxPkt_ChainMode();
        if(p != NULL)
        {
            list_add(ch307_mac_rec, p); /* add to rec list. */
        }
    }
    if(ETH->DMASR&ETH_DMA_IT_T)
    {
        ETH_DMAClearITPendingBit(ETH_DMA_IT_T);
    }

    ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);
}

/*********************************************************************
 * @fn      CH30x_RNG_GENERATE
 *
 * @brief   CH30x_RNG_GENERATE api function for lwip.
 *
 * @param   None.
 *
 * @return  None.
 */
uint32_t CH30x_RNG_GENERATE()
{
    while(1)
    {
        if(RNG_GetFlagStatus(RNG_FLAG_DRDY) == SET)
        {
            break;
        }
        if(RNG_GetFlagStatus(RNG_FLAG_CECS) == SET)
        {
            /* clock error / 时钟错误 */
            RNG_ClearFlag(RNG_FLAG_CECS);
            Delay_Us(100);
        }
        if(RNG_GetFlagStatus(RNG_FLAG_SECS) == SET)
        {
            /* seed error / 种子错误 */
            RNG_ClearFlag(RNG_FLAG_SECS);
            RNG_Cmd(DISABLE);
            Delay_Us(100);
            RNG_Cmd(ENABLE);
            Delay_Us(100);
        }
    }
    return RNG_GetRandomNumber();
}

uint32_t sysTicks = 0;

/*********************************************************************
 * @fn      sys_now
 *
 * @brief   sys_now api function for lwip.
 *
 * @param   None.
 *
 * @return  None.
 */
u32_t sys_now(void)
{
    return sysTicks;
}

__attribute__((naked)) void SysTick_Handler() {
    __asm volatile ("call SysTick_Handler_real; mret");
}
/*********************************************************************
 * @fn      SysTick_Handler
 *
 * @brief   SysTick中断函数
 *
 * @param   None.
 *
 * @return  None.
 */
void SysTick_Handler_real(void)
{
    sysTicks++;
    OS_UPDATE_TIMERS();
    SysTick->SR=0;
}

volatile uint8_t net_data_led_require = 0;
/*********************************************************************
 * @fn      net_led_tmr
 *
 * @brief   Called every NET_LED_PERIOD_MSECS to set LED status
 * lwip timeouts.c中period timer中增加的自定义超时函数，每NET_LED_PERIOD_MSECS周期调用
 *
 * @param   None.
 *
 * @return  None.
 */
void net_led_tmr(void)
{
    static uint8_t net_data_led = 0;

    if(net_data_led)
    {
        /* Currently on / 当前处在亮灯状态 */
        net_data_led = 0;
        Ethernet_LED_DATASET(1);/* turn off data led. */
    }
    else
    {
        /* If off, another packet will turn it on / 当前处在灭灯状态，如果本周期内又收到了数据包，亮灯 */
        if(net_data_led_require != 0)
        {
            net_data_led = 1;
            Ethernet_LED_DATASET(0);/* turn on data led. */
            net_data_led_require = 0;
        }
    }
}

/*********************************************************************
 * @fn      ETH_RxPkt_ChainMode
 *
 * @brief   MAC receive a ethernet frame in chain mode.
 *
 * @return  Frame information.
 */
void* ETH_RxPkt_ChainMode(void)
{
    uint32_t framelength = 0;
  FrameTypeDef *rec_frame;

  rec_frame = memb_alloc(&ch307_mac_rec_frame_mem);

  /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
  if((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) != (u32)RESET)
  {

